---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.DomainType
source: html/e7c71782-0730-876f-95d1-e928e6e74880.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.DomainType Property

The connector domain type of this segment.

## Syntax (C#)
```csharp
public ConnectorDomainType DomainType { get; }
```